{
    "Dragonborn":{
       "name":"Dragonborn",
       "image":"https://i.pinimg.com/236x/7d/8b/b1/7d8bb1e0f6e896d456871171891b73e1.jpg",
       "introduction":"The dragonborn walk proudly through a world that greets them with fearful incomprehension. Shaped by the dragons themselves, dragonborn originally hatched from dragon eggs as a unique race, combining the best attributes of dragons and humanoids.",
       "age":"Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.",
       "alignment":"Dragonborn tend towards extremes, making a conscious choice for one side or the other between Good and Evil (represented by Bahamut and Tiamat, respectively). More side with Bahamut than Tiamat (whose non-dragon followers are mostly kobolds), but villainous dragonborn can be quite terrible indeed. Some rare few choose to devote themselves to lesser dragon deities, such as Chronepsis (Neutral), and fewer still choose to worship Io, the Ninefold Dragon, who is all alignments at once.",
       "size":"Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can read, speak, and write Common and Draconic.",
       "abilityScoreIncrease":"Your Strength score increases by 2, and your Charisma score increases by 1.",
       "racialBonus":{
          "Strength":2,
          "Charisma":1
       },
       "similarRaces":{
          "firstName":"Half-Orc",
          "firstDescription":" +2 Strength",
          "secondName":"Tiefling",
          "secondDescription":" +2 Charisma"
       },
       "suitableClasses":{
          "firstName":"Fighter",
          "firstDescription":" Strength is a Primary Ability for a Fighter",
          "secondName":"Bard",
          "secondDescription":" Charisma is a Primary Ability for a Bard"
       }
    },
    "Dwarf":{
       "name":"Dwarf",
       "image":"https://i.pinimg.com/236x/94/79/3b/94793b0a60d5d635cd8f5fce25006a71.jpg",
       "introduction":"Kingdoms rich in ancient grandeur, halls carved into the roots of mountains, the echoing of picks and hammers in deep mines and blazing forges, a commitment to clan and tradition, and a burning hatred of goblins and orcs – these common threads unite all dwarves.",
       "age":"Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.",
       "alignment":"Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
       "size":"Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
       "speed":"Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.",
       "languages":"You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
       "abilityScoreIncrease":"Your Constitution score increases by 2.",
       "racialBonus":{
          "Constitution":2
       },
       "similarRaces":{
          "firstName":"Human",
          "firstDescription":" +1 to All Ability Scores",
          "secondName":"Half-Elf",
          "secondDescription":" +1 to Two Ability Scores, +2 to Charisma"
       },
       "suitableClasses":{
          "firstName":"Fighter",
          "firstDescription":" Mele Classes Need Constitution the Most",
          "secondName":"Barbarian",
          "secondDescription":" Mele Classes Need Constitution the Most"
       }
    },
    "Elf":{
       "name":"Elf",
       "image":"https://i.pinimg.com/564x/5d/b8/23/5db823eebc80060458d7f23529bac729.jpg",
       "introduction":"Elves are a magical people of otherworldly grace, living in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry.",
       "age":"Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
       "alignment":"Elves love freedom, variety, and self-expression, so they lean strongly towards the gentler aspects of chaos. They value and protect others' freedom as well as their own, and are good more often than not. Drow are an exception; their exile into the Underdark has made them vicious and dangerous. Drow are more often evil than not.",
       "size":"Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can speak, read, and write Common and Elven.",
       "abilityScoreIncrease":"Your Dexterity score increases by 2.",
       "racialBonus":{
          "Dexterity":2
       },
       "similarRaces":{
          "firstName":"Halfling",
          "firstDescription":" +2 Dexterity",
          "secondName":"Half-Elf",
          "secondDescription":" +1 to Two Ability Scores, +2 to Charisma"
       },
       "suitableClasses":{
          "firstName":"Rogue",
          "firstDescription":" Dexterity is a Primary Ability for a Rogue",
          "secondName":"Ranger",
          "secondDescription":" Dexterity is a Primary Ability for a Ranger"
       }
    },
    "Gnome":{
       "name":"Gnome",
       "image":"https://i.pinimg.com/236x/99/26/ca/9926ca7ef998c98e40a06df29dc8b3bf.jpg",
       "introduction":"A constant hum of busy activity pervades the warrens and neighborhoods where gnomes form their close-knit communities. Louder sounds punctuate the hum: a crunch of grinding gears here, a minor explosion there, a yelp of surprise or triumph, and especially bursts of laughter. Gnomes take delight in life, enjoying every moment of invention, exploration, investigation, creation, and play.",
       "age":"Gnomes mature at the same rate as humans, and most are expected to settle into adult life around the age of 40. They can live to 350 years on average, but it's not too uncommon for them to reach 500 years of age.",
       "alignment":"Gnomes are generally Good. Those who tend towards Law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend towards Chaos are often minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are light-hearted, and even the tricksters amongst them favor harmless pranks over vicious schemes.",
       "size":"Gnomes are between 3 and 4 feet tall and weigh around 40 pounds. Your size is Small.",
       "speed":"Your base walking speed is 25 feet.",
       "languages":"You can read, speak, and write Common and Gnomish.",
       "abilityScoreIncrease":"Your Intelligence score increases by 2.",
       "racialBonus":{
          "Intelligence":2
       },
       "similarRaces":{
          "firstName":"Tiefling",
          "firstDescription":" +1 Intelligence",
          "secondName":"Half-Elf",
          "secondDescription":" +1 to Two Ability Scores, +2 to Charisma"
       },
       "suitableClasses":{
          "firstName":"Wizard",
          "firstDescription":" Intelligence is a Primary Ability for a Wizard",
          "secondName":"Rogue",
          "secondDescription":" Your Small Size Gives You Advantage on Your Stealth Checks"
       }
    },
    "Half-Elf":{
       "name":"Half-Elf",
       "image":"https://i.pinimg.com/236x/78/1c/78/781c78e04b2049b19f71335f1f8698ec.jpg",
       "introduction":"Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves.",
       "age":"Half-elves age at much the same rate as humans, reaching adulthood at the age of 20. They live much longer than humans, however, often exceeding 180 years.",
       "alignment":"Half-elves share the chaotic bent of their elven heritage. They both value personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable. They are good and evil in equal numbers, a trait they share with their human parents.",
       "size":"Half-elves are more or less the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can read, speak, and write Common, Elven, and one language of your choice.",
       "abilityScoreIncrease":"Your Charisma score increases by 2, and two other ability scores of your choice each increase by 1.",
       "racialBonus":{
          "Charisma":2
       },
       "halfElfExtraAttrs":[
          
       ],
       "similarRaces":{
          "firstName":"Tiefling",
          "firstDescription":" +2 Charisma",
          "secondName":"Elf",
          "secondDescription":" +2 Dexterity"
       },
       "suitableClasses":{
          "firstName":"Sorcerer",
          "firstDescription":" Charisma is a Primary Ability for a Sorcerer",
          "secondName":"Paladin",
          "secondDescription":" Charisma is a Primary Ability for a Paladin"
       }
    },
    "Half-Orc":{
       "name":"Half-Orc",
       "image":"https://i.pinimg.com/236x/72/26/e5/7226e55385fdce0cb4105821fc8994b4.jpg",
       "introduction":"When alliances between humans and orcs are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other more civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric customs and savage fury.",
       "age":"Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.",
       "alignment":"Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.",
       "size":"Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script.",
       "abilityScoreIncrease":"Your Strength score increases by 2, and your Constitution score increases by 1.",
       "racialBonus":{
          "Strength":2,
          "Constitution":1
       },
       "similarRaces":{
          "firstName":"Human",
          "firstDescription":" +1 to All Ability Scores",
          "secondName":"Dwarf",
          "secondDescription":" +2 Constitution"
       },
       "suitableClasses":{
          "firstName":"Fighter",
          "firstDescription":" Strength is a Primary Ability for a Fighter",
          "secondName":"Barbarian",
          "secondDescription":" Strength is a Primary Ability for a Barbarian"
       }
    },
    "Halfling":{
       "name":"Halfling",
       "image":"https://i.pinimg.com/236x/72/81/0b/72810b2b7c8909ac6c5636088ebd26f7.jpg",
       "introduction":"The comforts of home are the goals of most halflings' lives: a place to settle in peace and quiet, far from marauding monsters and clashing armies. Others form nomadic bands that travel constantly, lured by the open road and the wide horizon to discover the wonders of new lands and peoples. Halflings work readily with others, and they are loyal to their friends, whether halfling or otherwise. They can display remarkable ferocity when their friends, families, or communities are threatened.",
       "age":"A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
       "alignment":"Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of the old ways.",
       "size":"Halflings average about 3 feet tall and weigh about 40 pounds. Your size is small.",
       "speed":"Your base walking speed is 25 feet.",
       "languages":"You can speak, read, and write Common and Halfling.",
       "abilityScoreIncrease":"Your Dexterity score increases by 2.",
       "racialBonus":{
          "Dexterity":2
       },
       "similarRaces":{
          "firstName":"Elf",
          "firstDescription":" +2 Dexterity",
          "secondName":"Half-Elf",
          "secondDescription":" +1 to Two Ability Scores, +2 to Charisma"
       },
       "suitableClasses":{
          "firstName":"Monk",
          "firstDescription":" Dexterity is a Primary Ability for a Monk",
          "secondName":"Ranger",
          "secondDescription":" Dexterity is a Primary Ability for a Ranger"
       }
    },
    "Human":{
       "name":"Human",
       "image":"https://i.pinimg.com/236x/05/6f/61/056f6147337010aed86ffabe25687f37.jpg",
       "introduction":"In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that's why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.",
       "age":"Humans reach adulthood in their late teens and live less than a century.",
       "alignment":"Humans tend toward no particular alignment. The best and the worst are found among them.",
       "size":"Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on.",
       "abilityScoreIncrease":"Your ability scores each increase by 1.",
       "racialBonus":{
          "Strength":1,
          "Dexterity":1,
          "Constitution":1,
          "Intelligence":1,
          "Wisdom":1,
          "Charisma":1
       },
       "similarRaces":{
          "firstName":"Half-Orc",
          "firstDescription":" +2 Strength",
          "secondName":"Half-Elf",
          "secondDescription":" +1 to Two Ability Scores, +2 to Charisma"
       },
       "suitableClasses":{
          "firstName":"Monk",
          "firstDescription":" Has Two Primary Abilities: Wisdom and Dexterity",
          "secondName":"Paladin",
          "secondDescription":" Has Two Primary Abilities: Strength and Charisma"
       }
    },
    "Tiefling":{
       "name":"Tiefling",
       "image":"https://i.pinimg.com/236x/15/36/1b/15361b13b8a28d959bfbe1c249e86c8a.jpg",
       "introduction":"To be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling. And to twist the knife, tieflings know that this is because a pact struck generations ago infused the essence of Asmodeus, overlord of the Nine Hells (and many of the other powerful devils serving under him) into their bloodline. Their appearance and their nature are not their fault but the result of an ancient sin, for which they and their children and their children's children will always be held accountable.",
       "age":"Tieflings mature at the same rate as humans but live a few years longer.",
       "alignment":"Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.",
       "size":"Tieflings are about the same size and build as humans. Your size is Medium.",
       "speed":"Your base walking speed is 30 feet.",
       "languages":"You can speak, read, and write Common and Infernal.",
       "abilityScoreIncrease":"Your Charisma score increases by 2 and your Intelligence score increases by 1.",
       "racialBonus":{
          "Charisma":2,
          "Intelligence":1
       },
       "similarRaces":{
          "firstName":"Half-Elf",
          "firstDescription":" +2 Charisma",
          "secondName":"Human",
          "secondDescription":" +1 to All Ability Scores"
       },
       "suitableClasses":{
          "firstName":"Warlock",
          "firstDescription":" Charisma is a Primary Ability for a Warlock",
          "secondName":"Bard",
          "secondDescription":" Charisma is a Primary Ability for a Bard"
       }
    }
}

 